# TuGraph 查询语言 OpenCypher 简介
#docslug#/tugraph/TuGraph/V3.0.0/introduction-to-opencypher-in-tugraph-query-language
>**说明**
>
>下述 `✓` 代表支持，`❏` 与 `☒` 代表不支持。

## Operators

### Summary

Operators 支持进度一览：

|                  类别                  |                                                  支持                                                  |               待支持               |
|--------------------------------------|------------------------------------------------------------------------------------------------------|---------------------------------|
| General Operators                    | `DISTINCT`, `.`for property access                                                                   | `[]`for dynamic property access |
| Mathematical Operators               | `+`， `-`， `*`， `/`，`%`， `^`                                                                          | 无                               |
| String-specific Comparison Operators | `=`，`<>`，`*`，`/`，`&`，`^`                                                                             | 无                               |
| Boolean Operators                    | `STARTS WITH`, `ENDS WITH`, `CONTAINS`,`REGEXP`                                                     | 无                               |
| String Operators                     | `AND`, `OR`, `XOR,``NOT`                                                                             | 无                               |
| String operators                     | `+` for concatenation                                                                                | 无                               |
| List Operators                       | `+` for concatenation, `IN` to check existence of an element in a list, `[]`for accessing element(s) | 无                               |

### General Operators

* ✓ Using the DISTINCT operator

  ```sql
  CREATE (a:Person {name: 'Anne', eyeColor: 'blue'}),
  (b:Person {name: 'Bill', eyeColor: 'brown'}),
  (c:Person {name: 'Carol', eyeColor: 'blue'})
  ```

  ```sql
  MATCH (p:Person ) RETURN DISTINCT p.eyeColor
  ```

* ✓ Accessing properties of a nested literal map using the `.` operator

  ```sql
  WITH {person: {name: 'Anne', age: 25}} AS p
  RETURN p.person.name
  ```

* ❏ Filtering on a dynamically-computed property key using the `[]` operator

  ```sql
  CREATE (a:Restaurant {name: 'Hungry Jo', rating_hygiene: 10, rating_food: 7}),
  (b:Restaurant {name: 'Buttercup Tea Rooms', rating_hygiene: 5, rating_food:6}),
  (c1:Category {name: 'hygiene'}), (c2:Category {name: 'food'})
  ```

### Mathematical operators

* ✓ Using the exponentiation operator `^`

  ```sql
  WITH 2 AS number, 3 AS exponent
  RETURN number ^ exponent AS result
  ```

* ✓ Using the unary minus operator `-`

  ```sql
  WITH -3 AS a, 4 AS b
  RETURN b - a AS result
  ```

### Comparison Operators

* ✓ Comparing two numbers

```sql
WITH 4 AS one, 3 AS two
RETURN one > two AS result
```

### String-Specific Comparison Operators

* ✓ Using Starts With To Filter Names

```sql
WITH ['John', 'Mark', 'Jonathan', 'Bill'] AS somenames
UNWIND somenames AS names
WITH names AS candidate
WHERE candidate STARTS WITH 'Jo'
RETURN candidate
```

* ✓ Using Regexp To Filter Names

```sql
WITH ['John', 'Mark', 'Jonathan', 'Bill'] AS somenames
UNWIND somenames AS names
WITH names AS candidate
WHERE candidate REGEXP 'Jo.*n'
RETURN candidate
```

### Boolean Operators

* ✓ Using Boolean Operators To Filter Numbers

```sql
WITH [2, 4, 7, 9, 12] AS numberlist
UNWIND numberlist AS number
WITH number
WHERE number = 4 OR (number > 6 AND number < 10)
RETURN number
```

### String Operators

String Operators Comprise：

* concatenating Strings：`+`

More details on string-specific comparison operators can be found [here](#here)

### List Operators

* ✓ Concatenating two lists using `+`

  ```sql
  RETURN [1,2,3,4,5]+[6,7] AS myList
  ```

* ✓ Using IN to check if a number is in a list

  ```sql
  WITH [2, 3, 4, 5] AS numberlist
  UNWIND numberlist AS number
  WITH number
  WHERE number IN [2, 3, 8]
  RETURN number
  ```

* ✓ Accessing elements in a list using the `[]` operator

  ```sql
  WITH ['Anne', 'John', 'Bill', 'Diane', 'Eve'] AS names
  RETURN names[1..3] AS result
  ```

### Clauses

Summary

Clauses 支持进度一览：

|           类别            |                     语法                      | 备注  |
|-------------------------|---------------------------------------------|-----|
| Reading clauses         | MATCH                                       | 支持  |
| Reading clauses         | OPTIONAL MATCH                              | 支持  |
| Reading clauses         | MANDATORY MATCH                             | 待支持 |
| Projecting clauses      | RETURN ... \[AS\]                           | 支持  |
| Projecting clauses      | WITH ... \[AS\]                             | 支持  |
| Projecting clauses      | UNWIND ... \[AS\]                           | 支持  |
| Reading sub-clauses     | WHERE                                       | 支持  |
| Reading sub-clauses     | ORDER BY \[ASC\[ENDING\] / DESC\[ENDING\]\] | 支持  |
| Reading sub-clauses     | SKIP                                        | 支持  |
| Reading sub-clauses     | LIMIT                                       | 支持  |
| Writing clauses         | CREATE                                      | 支持  |
| Writing clauses         | DELETE                                      | 支持  |
| Writing clauses         | DETACH DELETE                               | 支持  |
| Writing clauses         | SET                                         | 支持  |
| Writing clauses         | REMOVE                                      | 支持  |
| Reading/Writing clauses | MERGE                                       | 支持  |
| Reading/Writing clauses | CALL \[...YIELD\]                           | 支持  |
| Set operations          | UNION                                       | 待支持 |
| Set operations          | UNION ALL                                   | 支持  |

### MATCH

* Basic node finding

  * ✓ Get all nodes

  * ✓ Get all nodes with a label

  * ✓ Related nodes

  * ✓ Match with labels

* Relationship basics

  * ✓ Outgoing relationships

  * ✓ Directed relationships and variable

  * ✓ Match on relationship type

  * ✓ Match on multiple relationship types

  * ✓ Match on relationship type and use a variable

* Relationships in depth

  * ❏ Relationship types with uncommon characters

    ```sql
    MATCH (n {name: 'Rob Reiner'})-[r:`TYPE WITH SPACE`]->()
    RETURN type(r)
    ```

  * ✓ Multiple relationships

    ```sql
    MATCH (charlie {name: 'Charlie Sheen'})-[:ACTED_IN]->(movie)<-[:DIRECTED]-(director)
    RETURN movie.title, director.name
    ```

  * ✓ Variable-length relationships

    ```sql
    MATCH (martin {name: 'Charlie Sheen'})-[:ACTED_IN*1..3]-(movie:Movie)
    RETURN movie.title
    ```

  * ✓ Relationship variable in variable-length relationships

    ```sql
    MATCH p = (actor {name: 'Charlie Sheen'})-[:ACTED_IN*2]-(co_actor)
    RETURN relationships(p)
    ```

  * ❏ Match with properties on a variable-length path

    ```sql
    MATCH p = (charlie:Person)-[* {blocked:false}]-(martin:Person)
    WHERE charlie.name = 'Charlie Sheen' AND martin.name = 'Martin Sheen'
    RETURN p
    ```

  * ✓ Zero-length paths

    ```sql
    MATCH (wallstreet:Movie {title: 'Wall Street'})-[*0..1]-(x)
    RETURN x
    ```

  * ✓ Named paths

    ```sql
    MATCH p = (michael {name: 'Michael Douglas'})-[]->() RETURN p
    ```

  * ✓ Matching on a bound relationship

    ```sql
    MATCH (a)-[r]-(b)
    WHERE id(r)= 0
    RETURN a,b
    ```

* Shortest path

  * ✓ Single shortest path

  * ✓ All shortest paths

* Get node or relationship by id

  * ✓ Node by id

  * ☒ Relationship by id

  * ✓ Multiple nodes by id

### RETURN

* ✓ Return nodes

  ```sql
  MATCH (n {name: 'B'}) RETURN n
  ```

  **Note**

  Return `id` of n.
  
* ✓ Return relationships

  ```sql
  MATCH (n {name: 'A'})-[r:KNOWS]->(c)
  RETURN r
  ```

  **Note**

  Return `EdgeUid` of r.
  
* ✓ Return property

  ```sql
  MATCH (n {name: 'A'}) RETURN n.name
  ```

* ❏ Return all elements

  ```sql
  MATCH p = (a {name: 'A'})-[r]->(b)
  RETURN *
  ```

* ❏ Variable with uncommon characters

  ```sql
  MATCH (`This isn\'t a common variable`)
  WHERE `This isn\'t a common variable`.name = 'A'
  RETURN `This isn\'t a common variable`.happy
  ```

* ✓ Aliasing a field

  ```sql
  MATCH (a {name: 'A'})
  RETURN a.age AS SomethingTotallyDifferent
  ```

* ✓ Optional properties

  ```sql
  MATCH (n)
  RETURN n.age
  ```

* ❏ Other expressions

  ```sql
  MATCH (a {name: 'A'})
  RETURN a.age > 30, "I'm a literal", (a)-[]->()
  ```

  `(a)-[]->()` not supported.
  
* ✓ Unique results

  ```sql
  MATCH (a {name: 'A'})-[]->(b)
  RETURN DISTINCT b
  ```

### WHERE

* Basic usage

  * ✓ Boolean operations

  ```sql
  MATCH (n)
  WHERE n.name = 'Peter' XOR (n.age < 30 AND n.name = 'Tobias') OR NOT (n.name =
  'Tobias' OR n.name = 'Peter')
  RETURN n.name, n.age
  ```

  * ✓ Filter on node label

  ```sql
  MATCH (n)
  WHERE n:Swedish
  RETURN n.name, n.age
  ```

  * ✓ Filter on node property

  ```sql
  MATCH (n)
  WHERE n.age < 30
  RETURN n.name, n.age
  ```

  * ✓ Filter on relationship property

  ```sql
  MATCH (n)-[k:KNOWS]->(f)
  WHERE k.since < 2000
  RETURN f.name, f.age, f.email
  ```

  * ❏ Filter on dynamically-computed property

  ```sql
  WITH 'AGE' AS propname
  MATCH (n)
  WHERE n[toLower(propname)]< 30
  RETURN n.name, n.age
  ```

  * ✓ Property existence checking

  ```sql
  MATCH (n)
  WHERE exists(n.belt)
  RETURN n.name, n.belt
  ```

* String matching

  * ✓ Match the beginning of a string

  ```sql
  MATCH (n)
  WHERE n.name STARTS WITH 'Pet'
  RETURN n.name, n.age
  ```

  * ✓ Match the ending of a string

  ```sql
  MATCH (n)
  WHERE n.name ENDS WITH 'ter'
  RETURN n.name, n.age
  ```

  * ✓ Match anywhere within a string

  ```sql
  MATCH (n)
  WHERE n.name CONTAINS 'ete'
  RETURN n.name, n.age
  ```

  * ✓ String matching negation

  ```sql
  MATCH (n)
  WHERE NOT n.name ENDS WITH 's'
  RETURN n.name, n.age
  ```

* Using path patterns in `WHERE`

  * ✓ Filter on patterns

    ```sql
    MATCH (tobias {name: 'Tobias'}), (others)
    WHERE others.name IN ['Andres', 'Peter'] AND (tobias)<-[]-(others)
    RETURN others.name, others.age
    ```

  * ✓ Filter on patterns using NOT

    ```sql
    MATCH (persons), (peter {name: 'Peter'})
    WHERE NOT (persons)-[]->(peter)
    RETURN persons.name, persons.age
    ```

  * ✓ Filter on patterns with properties

    ```sql
    MATCH (n)
    WHERE (n)-[:KNOWS]-({name: 'Tobias'})
    RETURN n.name, n.age
    ```

  * ✓ Filter on relationship type

    ```sql
    MATCH (n)-[r]->()
    WHERE n.name='Andres' AND type(r) STARTS WITH 'K'
    RETURN type(r), r.since
    ```

<!-- -->

* Lists

  * ✓ IN operator

  ```sql
  MATCH (a)
  WHERE a.name IN ['Peter', 'Tobias']
  RETURN a.name, a.age
  ```

* Missing properties and values

  * ✓ Default to false if property is missing

  ```sql
  MATCH (n)
  WHERE n.belt = 'white'
  RETURN n.name, n.age, n.belt
  ```

  * ✓ Default to true if property is missing

  ```sql
  MATCH (n)
  WHERE n.belt = 'white' OR n.belt IS NULL RETURN n.name, n.age, n.belt
  ORDER BY n.name
  ```

  * ✓ Filter on null

  ```sql
  MATCH (person)
  WHERE person.name = 'Peter' AND person.belt IS NULL RETURN person.name, person.age,
  person.belt
  ```

* Using ranges

  * ✓ Simple range

  ```sql
  MATCH (a)
  WHERE a.name >= 'Peter'
  RETURN a.name, a.age
  ```

  * ✓ Composite range

  ```sql
  MATCH (a)
  WHERE a.name > 'Andres' AND a.name < 'Tobias'
  RETURN a.name, a.age
  ```

### SKIP

* ✓ Skip first three records

```sql
MATCH (n)
RETURN n.name
ORDER BY n.name
SKIP 3
```

* ✓ Return middle two records

```sql
MATCH (n)
RETURN n.name
ORDER BY n.name
SKIP 1
LIMIT 2
```

* ✓ Using an expression with SKIP to return a subset of the records

```sql
MATCH (n)
RETURN n.name
ORDER BY n.name
SKIP toInteger(3*rand())+ 1
```

### LIMIT

* ✓ Return A Subset Of The Records

```sql
MATCH (n)
RETURN n.name
LIMIT 3
```

* ✓ Using An Expression With LIMIT To Return A Subset Of The Records

```sql
MATCH (n)
RETURN n.name
LIMIT toInteger(3 * rand())+ 1
```

### CREATE

* Create Nodes

  >**说明**
  >
  >TuGraph 不支持创建空的 nodes，不支持多 labels。
  * ☒ Create Single node

  ```sql
  CREATE (n)
  ```

  * ☒ Create multiple nodes

  ```sql
   CREATE (n), (m)
  ```

  * ✓ Create A Node With A Label

  ```sql
  CREATE (n:Person)
  ```

  * ☒ Create A node with multiple labels

  ```sql
  CREATE (n:Person:Swedish)
  ```

  * ✓ Create node And Add Labels And properties

  ```sql
  CREATE (n:Person {name: 'Andres', title: 'Developer'})
  ```

  * ✓ Return Created Node

  ```sql
  CREATE (a {name: 'Andres'})
  RETURN a
  ```

<!-- -->

* Create Relationships

  * ✓ Create A Relationship Between Two Nodes

  ```sql
  MATCH (a:Person), (b:Person)
  WHERE a.name = 'Node A' AND b.name = 'Node B'
  CREATE (a)-[r:RELTYPE]->(b)
  ```

  * ✓ Create A Relationship And Set Properties

  ```sql
  MATCH (a:Person), (b:Person)
  WHERE a.name = 'Node A' AND b.name = 'Node B'
  CREATE (a)-[r:RELTYPE {name: a.name + '<->' + b.name}]->(b)
  ```

  * ✓ Create A Full Path

  ```sql
  CREATE p = (andres {name:'Andres'})-[:WORKS_AT]->(neo)<-[:WORKS_AT]-(michael {name:'Michael'})
  RETURN p
  ```

<!-- -->

* Use parameters with CREATE

  * ❏ Create node with a parameter for the properties

  ```sql
  CREATE (n:Person $props)
  RETURN n
  ```

  * ☒ Create multiple nodes with a parameter for their properties

  ```sql
  UNWIND $props AS map
  CREATE (n)
  SET n = map
  ```

  >**说明**
  >
  > Cannot Create Vertex Without Label。
  
### CALL\[...YIELD\]

* ✓ Call a procedure using CALL

```sql
CALL db.labels
```

* ✓ View the signature for a procedure

```sql
CALL dbms.procedures() YIELD name, signature
WHERE name='dbms.listConfig'
RETURN signature
```

* ❏ Call a procedure using a quoted namespace and name

```sql
CALL `db`.`labels`
```

* ✓ Call a procedure with literal arguments

```sql
CALL org.opencypher.procedure.example.addNodeToIndex('users', 0, 'name')
```

* ❏ Call a procedure with parameter arguments

```sql
CALL org.opencypher.procedure.example.addNodeToIndex($indexName,$node,$propKey)
```

* ❏ Call a procedure with mixed literal and parameter arguments

```sql
CALL org.opencypher.procedure.example.addNodeToIndex('users', $node, 'name')
```

* ✓ Call a procedure with literal and default arguments

```sql
 CALL org.opencypher.procedure.example.addNodeToIndex('users', 0)
```

* ✓ Call a procedure within a complex query using CALL...YIELD

```sql
CALL db.labels() YIELD label
RETURN count(label) AS numLabels
```

* ✓ Call a procedure and filter its results

```sql
CALL db.labels() YIELD label
WHERE label CONTAINS 'User'
RETURN count(label) AS numLabels
```

* ❏ Call a procedure within a complex query and rename its outputs

```sql
CALL db.propertyKeys() YIELD propertyKey AS prop
MATCH (n)
WHERE n[prop] IS NOT NULL RETURN prop, count(n) AS numNodes
```

### UNION

* ✓ Combine two queries and retain duplicates

```sql
MATCH (n:Actor)
RETURN n.name AS name
UNION ALL MATCH (n:Movie)
RETURN n.title AS name
```

* ❏ Combine two queries and remove duplicates

```sql
MATCH (n:Actor)
RETURN n.name AS name
UNION
MATCH (n:Movie)
RETURN n.title AS name
```

### Functions

### Whole List Of Functions

|           种类           |        功能        |       备注        |
|------------------------|------------------|-----------------|
| Predicate functions    | exists()         | 无               |
| Predicate functions    | all()            | 无               |
| Predicate functions    | any()            | 无               |
| Predicate functions    | single()         | 无               |
| Predicate functions    | none()           | 无               |
| Scalar functions       | id()             | 无               |
| Scalar functions       | properties()     | 无               |
| Scalar functions       | head()           | 无               |
| Scalar functions       | last()           | 无               |
| Scalar functions       | toBoolean()      | 无               |
| Scalar functions       | toFloat()        | 无               |
| Scalar functions       | toInteger()      | 无               |
| Scalar functions       | toString()       | 无               |
| Scalar functions       | type()           | 无               |
| Scalar functions       | startnode()      | 无               |
| Scalar functions       | endnode()        | 无               |
| Scalar functions       | size()           | 无               |
| Scalar functions       | length()         | 无               |
| Scalar functions       | endnode()        | 无               |
| label()                | OpenCypher扩展方法   | 无               |
| Aggregating functions  | avg()            | 无               |
| Aggregating functions  | collect()        | 无               |
| Aggregating functions  | count()          | 无               |
| Aggregating functions  | max()            | 无               |
| Aggregating functions  | min()            | 无               |
| Aggregating functions  | percentileCont() | 无               |
| Aggregating functions  | percentileDisc() | 无               |
| Aggregating functions  | stDev()          | 无               |
| Aggregating functions  | stDevP()         | 无               |
| Aggregating functions  | variance()       | 无               |
| Aggregating functions  | varianceP()      | 无               |
| Aggregating functions  | sum()            | 无               |
| List functions         | keys()           | 无               |
| List functions         | labels()         | 返回结果有且只有一个Label |
| List functions         | range()          | 无               |
| List functions         | subscript()      | 无               |
| Mathematical functions | abs()            | 无               |
| Mathematical functions | ceil()           | 无               |
| Mathematical functions | floor()          | 无               |
| Mathematical functions | rand()           | 无               |
| Mathematical functions | round()          | 无               |
| Mathematical functions | sign()           | 无               |
| String functions       | 无                | 无               |

### Predicate Functions

* id()

  get the id of vertex.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (a)
  RETURN id(a)
  ```

  **Example output:**
  
  | vid |
  |-----|
  | 1   |
  | 2   |
  | ... |

* properties()

  get a map containing all the properties of a node or relationship.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  CREATE (p:Person {name: 'Stefan', city: 'Berlin'})
  RETURN properties(p)
  ```

  **Example output:**
  
  |        properties         |
  |---------------------------|
  | {name:Stefan,city:Berlin} |

* head()

  get the first element of a list.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (a)
  WHERE a.name = 'Eskil'
  RETURN a.array, head(a.array)
  ```

  **Example output:**
  
  |         a.array         | head(a.array) |
  |-------------------------|---------------|
  | \["one","two","three"\] | "one"         |

* last()

  get the last element of a list.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (a)
  WHERE a.name = 'Eskil'
  RETURN a.array, last(a.array)
  ```

  **Example output:**
  
  |         a.array         | last(a.array) |
  |-------------------------|---------------|
  | \["one","two","three"\] | "three"       |

* toFloat()

  Converts an integer or string value to a floating point number.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN toFloat('11.5'), toFloat('not a number')
  ```

  **Example output:** \| float \| \| ----- \| \| 11.5 \| \|null\|
  
* toInteger()

  Converts a floating point or string value to an integer value.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN toInteger('2.3') AS integer
  ```

  **Example output:**
  
  | integer |
  |---------|
  | 2       |

* toString()

  Converts an integer, float, boolean value to a string.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN toString(2.3)
  ```

* type()

  get the string representation of the relationship type.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n)-[r]->()
  WHERE n.name = 'Alice'
  RETURN type(r)
  ```

  **Example output:**
  
  |   type   |
  |----------|
  | acted_in |
  | acted_in |

### Aggregating Functions

* avg()

  Returns the average of a set of numeric values.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN avg(n.age)
  ```

  **Example output:**
  
  |    avg(n.born)     |
  |--------------------|
  | 1869.2661654135338 |

* collect()

  Returns a list containing the values returned by an expression.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN collect(n.age)
  ```

  **Example output:**
  
  | collect(n.born) |
  |-----------------|
  | \[1967,...\]    |

* count()

  Returns the number of values or records.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n {name: 'A'})-[]->(x)
  RETURN labels(n), n.age, count(*)
  ```

  **Example output:**
  
  |  labels(n)   | n.age | count(\*) |
  |--------------|-------|-----------|
  | \["Person"\] | 13    | 3         |

* max()

  Returns the maximum value in a set of values.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN max(n.age)
  ```

  **Example output:**
  
  | max(n.age) |
  |------------|
  | 44         |

* min()

  Returns the minimum value in a set of values.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN min(n.age)
  ```

  **Example output:**
  
  | min(n.age) |
  |------------|
  | 13         |

* percentileCont()

  Returns the percentile of a value over a group using linear interpolation.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN percentileCont(n.age, 0.4)
  ```

  **Example output:**
  
  | percentileCont(n.age, 0.4) |
  |----------------------------|
  | 29                         |

<!-- -->

* percentileDisc()

  Returns the nearest value to the given percentile over a group using a rounding method.

  **Scope:** whole instance.

  **Output:** the percentile of the given value over a group.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN percentileDisc(n.age, 0.5)
  ```

  **Example output:**
  
  | percentileDisc(n.age, 0.5) |
  |----------------------------|
  | 33                         |

* stDev()

  Returns the standard deviation for the given value over a group for a sample of a population.

  **Scope:** whole instance.

  **Example input:**

  ```unknow
  MATCH (n)
  WHERE n.name IN ['A', 'B', 'C']
  RETURN stDev(n.age)
  ```

  **Example output:**
  
  |    stDev(n.age)    |
  |--------------------|
  | 15.716233645501712 |

* stDevP()

  Returns the standard deviation for the given value over a group for an entire population.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n)
  WHERE n.name IN ['A', 'B', 'C']
  RETURN stDevP(n.age)
  ```

  **Example output:**
  
  |   stDevP(n.age)    |
  |--------------------|
  | 12.832251036613439 |

* variance()

  Returns the variance for the given value over a group for a sample of a population.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n)
  WHERE n.name IN ['A', 'B', 'C']
  RETURN variance(n.age)
  ```

  **Example output:**
  
  | variance(n.age) |
  |-----------------|
  | 247             |

* varianceP()

  Returns the variance for the given value over a group for an entire population.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n)
  WHERE n.name IN ['A', 'B', 'C']
  RETURN varianceP(n.age)
  ```

  **Example output:**
  
  | varianceP(n.age) |
  |------------------|
  | 164.66666666667  |

* sum()

  Returns the sum of a set of numeric values.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (n:Person)
  RETURN sum(n.age)
  ```

  **Example output:**
  
  | sum(n.age) |
  |------------|
  | 90         |

### List Funtions

* keys()

  get the field names of some vertex.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (a)
  WHERE a.name = 'Alice'
  RETURN keys(a)
  ```

  **Example output:**
  
  |         keys(a)         |
  |-------------------------|
  | \["name","age","eyes"\] |

* labels()/label()

  Returns a list containing the string representations for all the property names of a node, relationship, or map.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (a)
  WHERE a.name = 'Alice'
  RETURN labels(a)
  ```

  **Example output:**
  
  |          labels          |
  |--------------------------|
  | \["Person","Developer"\] |

### Mathematical Functions

* abs()

  get the absolute value of some data.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  MATCH (a), (e)
  WHERE a.name = 'Alice' AND e.name = 'Eskil'
  RETURN a.age, e.age, abs(a.age - e.age)
  ```

  **Example output:**
  
  | a.age | e.age | abs(a.age - e.age) |
  |-------|-------|--------------------|
  | 38    | 41    | 1                  |

* ceil()

  Returns the smallest floating point number that is greater than or equal to a number and equal to a mathematical integer.

  **Scope:** whole instance. **Example input:**

  ```sql
  RETURN ceil(0.1)
  ```

  **Example output:**
  
  | ceil(0.1) |
  |-----------|
  | 1.0       |

* floor()

  get the largest floating point number that is less than or equal to the given number and equal to a mathematical integer.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN floor(0.9)
  ```

  **Example output:**
  
  | floor(0.9) |
  |------------|
  | 0.0        |

* round()

  Returns the value of a number rounded to the nearest integer.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN round(3.141592)
  ```

  **Example output:**
  
  | round |
  |-------|
  | 3     |

* rand()

  Returns returns a random floating point number in the range from 0 (inclusive) to 1 exclusive).

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN rand()
  ```

  **Example output:**
  
  |       rand()       |
  |--------------------|
  | 0.9797131960534085 |

* sign()

  Get the signum of the given number: 0 if the number is 0, -1 for any negative number, and 1 for any positive number.

  **Scope:** whole instance.

  **Example input:**

  ```sql
  RETURN sign(-17), sign(0.1)
  ```

  **Example output:**
  
  | sign(-17) | sign(0.1) |
  |-----------|-----------|
  | -1        | 1         |

## 附录1. 语法扩充及不同

TuGraph查询语言与OpenCypher的不同点如下：

* Label数量

  * TuGraph: Each node/relationship must have one and only one label. So error occurs when there is no label, and the 1st label will be picked as the label if there are more than one label.

  * OpenCypher: One node/relationship may have 0 to many labels.

* Schema.

  * TuGraph: TuGraph has strong schema

  * OpenCypher: schema-less

## 附录2. 内置 Procedures 列表

### Procedures 样例

* dbms.procedures()

  Lists all available procedures.

  **Scope:** whole instance.

  **Output:** a list of {`signature`, `name`}.

  **Example input:**

  ```sql
  CALL dbms.procedures()
  ```

  **Example output:**
  
  |                      signature                       |         name         |
  |------------------------------------------------------|----------------------|
  | db.labels() :: (label::STRING)                       | db.labels            |
  | db.relationshipTypes() :: (relationshipType::STRING) | db.relationshipTypes |
  | db.indexes() :: (index::LIST)                        | db.indexes           |
  | ...                                                  | ...                  |

* db.labels()

  Lists all available labels of vertex.

  **Scope:** whole instance.

  **Output:** a list of {`name`}.

  **Example input:**

  ```sql
  CALL db.labels()
  ```

  **Example output:**
  
  |  label  |
  |---------|
  | genre   |
  | keyword |
  | movie   |
  | ...     |

* db.relationshipTypes()

  Lists all available labels of edges.

  **Scope:** whole instance.

  **Output:** a list of .

  **Example input:**

  ```sql
  CALL db.relationshipTypes()
  ```

  **Example output:**
  
  | relationshipType |
  |------------------|
  | acted_in         |
  | directed         |
  | ...              |

* db.addLabel(label_name, field_spec...)

  Create a vertex label.

  **Scope:** whole instance.

  **Parameters:**
  
  | parameter  | parameter type |       description        |
  |------------|----------------|--------------------------|
  | label_name | string         | name of  vertex label    |
  | field_spec | list           | specification of a field |

  in which each `field_spec` is a list of string in the form of `[field_name, field_type, true]`, where true is specified only for optional fields.

  **Output:** If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL db.addLabel('Person', 'name', int64, true)
  ```

  **Example output:**

  ```sql
  Added label [Person]
  ```

* db.getLabelSchema(label_type, label_name)

  Get the schema definition of the label in a subgraph.

  **Scope:** subgraph, as specified in the `graph` parameter in REST or RPC request.

  **Parameters:**
  
  | parameter  | parameter type |        description        |
  |------------|----------------|---------------------------|
  | label_type | string         | either 'vertex' or 'edge' |
  | label_name | string         | name of the label         |

  **Output:** a list of label specifications, in which each element is a list of the following fields:
  
  | field_name | field_type |          description          |
  |------------|------------|-------------------------------|
  | name       | string     | name of the field             |
  | type       | string     | type of the field             |
  | optional   | boolean    | whether the field is optional |

  **Example input:**

  ```sql
  CALL db.getLabelSchema('vertex', 'person')
  ```

  **Example output:**
  
  |     name     |  type  | optional |
  |--------------|--------|----------|
  | id           | INT32  | false    |
  | born         | INT32  | true     |
  | name         | STRING | true     |
  | poster_image | STRING | true     |

* db.createLabel(label_type, label_name, field_spec...)

  Create a vertex or edge label.

  **Parameters:**
  
  | parameter  | parameter type |        description        |
  |------------|----------------|---------------------------|
  | label_type | string         | either 'vertex' or 'edge' |
  | label_name | string         | name of the label         |
  | field_spec | list           | specification of a field  |

  in which each `field_spec` is a list of string in the form of `[field_name, field_type, 'optional']`, where 'optional' is specified only for optional fields.

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL db.createLabel('vertex', 'new_label', ['id', 'int32'], ['name', 'string', 'optional'])
  ```

  **Example output:**

  ```sql
  Vertex label [new_label] successfully added.
  ```

* db.deleteLabel(label_type, label_name)

  Delete a vertex or edge label.

  **Parameters:**
  
  | parameter  | parameter type |        description        |
  |------------|----------------|---------------------------|
  | label_type | string         | either 'vertex' or 'edge' |
  | label_name | string         | name of the label         |

  **Output:**
  
  | field_name | field_type |           description            |
  |------------|------------|----------------------------------|
  | affected   | integer    | number of vertexes/edges deleted |

  **Example input:**

  ```sql
  CALL db.deleteLabel('vertex', 'person')
  ```

  **Example output:**
  
  | affected |
  |----------|
  | 1024     |

* db.alterLabelDelFields(label_type, label_name, field_names)

  Delete specified fields from the label.

  **Parameters:**
  
  |  parameter  | parameter type  |          description          |
  |-------------|-----------------|-------------------------------|
  | label_type  | string          | either 'vertex' or 'edge'     |
  | label_name  | string          | name of the label             |
  | field_names | list of strings | names of the fields to delete |

  **Output:**
  
  | field_name | field_type |            description            |
  |------------|------------|-----------------------------------|
  | affected   | integer    | number of vertexes/edges modified |

  **Example input:**

  ```sql
  CALL db.alterLabelDelFields('vertex', 'person', ['name', 'image'])
  ```

  **Example output:**
  
  | affected |
  |----------|
  | 1024     |

* db.alterLabelAddFields(label_type, label_name, field_value_spec...)

  Adds specified fields to the label.

  **Parameters:**
  
  |    parameter     | parameter type |        description        |
  |------------------|----------------|---------------------------|
  | label_type       | string         | either 'vertex' or 'edge' |
  | label_name       | string         | name of the label         |
  | field_value_spec | list           | specification of a field  |

  in which each `field_value_spec` is a list of string in the form of `[field_name, field_type, field_value, 'optional']`, where: `field_value` is the default value of the field, while 'optional' is specified only for optional fields.

  **Output:**
  
  | field_name | field_type |            description            |
  |------------|------------|-----------------------------------|
  | affected   | integer    | number of vertexes/edges modified |

  **Example input:**

  ```sql
  CALL db.alterLabelAddFields(
  'vertex',
  'new_label',
  ['birth_date', 'DATE', '', 'optional'],
  ['img', 'BLOB', '', 'optional'])
  ```

  **Example output:**
  
  | affected |
  |----------|
  | 1024     |

* db.alterLabelModFields(label_type, label_name, field_spec...)

  Modifies the specified fields in the label.

  **Parameters:**
  
  | parameter  | parameter type |        description        |
  |------------|----------------|---------------------------|
  | label_type | string         | either 'vertex' or 'edge' |
  | label_name | string         | name of the label         |
  | field_spec | list           | specification of a field  |

  in which each `field_spec` is a list of string in the form of `[field_name, field_type, 'optional']`, where 'optional' is specified only for optional fields.

  **Output:**
  
  | field_name | field_type |            description            |
  |------------|------------|-----------------------------------|
  | affected   | integer    | number of vertexes/edges modified |

  **Example input:**

  ```sql
  CALL db.alterLabelModFields(
  'vertex',
  'new_label',
  ['birth_date', 'DATETIME', '1900-01-01 00:00:00'],
  ['gender', 'BOOL', false])
  ```

  **Example output:**
  
  | affected |
  |----------|
  | 1024     |

* db.addType( label_name, field_spec...)

  Create an edge label.

  **Parameters:**
  
  | parameter  | parameter type |       description        |
  |------------|----------------|--------------------------|
  | label_name | string         | name of the label        |
  | field_spec | list           | specification of a field |

  in which each `field_spec` is a list of string in the form of `[field_name, field_type, optional]`, where optional is specified as true, only for optional fields.

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL db.addType('KNOWS', 'name', int32,true)
  ```

  **Example output:**

  ```sql
  Added type [KNOWS]
  ```

* db.addIndex(label_name, field_name, is_unique)

  create an index on some field of one vertex label .

  **Parameters:**
  
  | parameter  | parameter type |              description              |
  |------------|----------------|---------------------------------------|
  | label_name | string         | name of the label                     |
  | field_name | string         | specification of a field              |
  | is_unique  | boolean        | Specifies whether the index is unique |

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL db.addIndex('Person', 'id', true)
  ```

  **Example output:**

  ```sql
  Added index [Perosn:id]
  ```

* dbms.security.changePassword(current_password ,new_password)

  Change the current user's password.

  **Parameters:**
  
  |    parameter     | parameter type |     description      |
  |------------------|----------------|----------------------|
  | current_password | string         | the current password |
  | new_password     | string         | new password         |

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL dbms.security.changePassword('73@TuGraph','admin')
  ```

  **Example output:**

  ```sql
  true
  ```

* dbms.security.changeUserPassword(user_name, new_password)

  Change the current user's password.

  **Parameters:**
  
  |  parameter   | parameter type |   description   |
  |--------------|----------------|-----------------|
  | user_name    | string         | the user's name |
  | new_password | string         | new password    |

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL dbms.security.changeUserPassword('quest','73@TuGraph')
  ```

  **Example output:**

  ```sql
  true
  ```

* dbms.security.createUser(user_name, password,is_admin)

  create new user on this graph database.

  **Parameters:**
  
  | parameter | parameter type |           description            |
  |-----------|----------------|----------------------------------|
  | user_name | string         | the new user name                |
  | password  | string         | the password of new user         |
  | is_admin  | boolean        | Specify the role of the new user |

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL dbms.security.createUser('quest',"admin",true)
  ```

  **Example output:**

  ```sql
  true
  ```

* dbms.security.deleteUser(user_name)

  delete user on this graph database.

  **Parameters:**
  
  | parameter | parameter type |         description         |
  |-----------|----------------|-----------------------------|
  | user_name | string         | the user name to be deleted |

  **Output:**

  If successful, it returns a success message.

  **Example input:**

  ```sql
  CALL dbms.security.deleteUser('quest')
  ```

  **Example output:**

  ```sql
  true
  ```

* dbms.security.listUsers()

  get all user's name of the graph database.

  **Output:**

  a list of user names, in which each element is a list of the following fields:
  
  | parameter | parameter type |         description         |
  |-----------|----------------|-----------------------------|
  | user.name | string         | the user name               |
  | is.admin  | boolean        | the permission of this user |

  **Example input:**

  ```sql
  CALL dbms.security.listUsers()
  ```

  **Example output:**
  
  | user.name | is.admin |
  |-----------|----------|
  | admin     | true     |
  | ...       | ...      |

* dbms.security.showCurrentUser()

  get current user's name.

  **Output:**

  a list of user names, in which each element is a list of the following fields:
  
  | parameter | parameter type |      description      |
  |-----------|----------------|-----------------------|
  | user.user | string         | the current user name |

  **Example input:**

  ```sql
  CALL dbms.security.showCurrentUser()
  ```

  **Example output:**
  
  | user.name |
  |-----------|
  | admin     |

* dbms.security.accessPermission(user_name, graph_name)

  get the access permission of some user.

  **Parameters:**
  
  | parameter  | parameter type |     description     |
  |------------|----------------|---------------------|
  | user_name  | string         | the  user's name    |
  | graph_name | string         | the subgraph's name |

  **Output:**

  a list of user names, in which each element is a list of the following fields:
  
  | parameter | parameter type |           description            |
  |-----------|----------------|----------------------------------|
  | acl       | string         | the acl of user on this subgraph |

  **Example input:**

  ```sql
  CALL dbms.security.accessPermission('admin', 'default')
  ```

  **Example output:**
  
  | acl  |
  |------|
  | FULL |

* dbms.security.setAccessPermission(user_name, graph_name,acl)

  set the act of some user to access subgraph.

  **Parameters:**
  
  | parameter  | parameter type |     description      |
  |------------|----------------|----------------------|
  | user_name  | string         | the  user's name     |
  | graph_name | string         | the subgraph's name  |
  | acl        | string         | the acl to be setted |

  **Output:**

  If successful, it returns true.

  **Example input:**

  ```sql
  CALL dbms.security.setAccessPermission('test', 'test','WRITE')
  ```

  **Example output:**

  ```sql
  true
  ```

* dbms.security.deleteAccessPermission(user_name, graph_name)

  delete the act of some user to access subgraph.

  **Parameters:**
  
  | parameter  | parameter type |     description     |
  |------------|----------------|---------------------|
  | user_name  | string         | the  user's name    |
  | graph_name | string         | the subgraph's name |

  **Output:**

  If successful, it returns true.

  **Example input:**

  ```sql
  CALL dbms.security.deleteAccessPermission('UserA', 'graph')
  ```

  **Example output:**

  ```sql
  true
  ```

* dbms.security.listAllowedHosts()

  get the list of ips to be allowed .

  **Output:**

  a list of ips which are allowed.

  **Example input:**

  ```sql
  CALL dbms.security.listAllowedHosts()
  ```

  **Example output:**
  
  |     host     |
  |--------------|
  | 192.168.1.22 |
  | ...          |

* dbms.security.deleteAllowedHosts(hosts)

  delete some ips from the list of ips to be allowed .

  **Output:**

  the number of ip which been deleted.

  **Example input:**

  ```sql
  CALL dbms.security.deleteAllowedHosts('192.168.1.22','192.168.1.23')
  ```

  **Example output:**
  
  | success |
  |---------|
  | 2       |

* dbms.security.addAllowedHosts(hosts)

  add some ips from the list of ips to be allowed .

  **Output:**

  the number of ip which been added.

  **Example input:**

  ```sql
  CALL dbms.security.addAllowedHosts('192.168.1.22','192.168.1.23')
  ```

  **Example output:**
  
  | success |
  |---------|
  | 2       |

* dbms.graph.createGraph(graph_name, description, max_size_GB)

  create a new subgraph in this graph database .

  **Parameters:**
  
  |  parameter  | parameter type |           description            |
  |-------------|----------------|----------------------------------|
  | graph_name  | string         | the name of new subgraph         |
  | description | string         | description of new subgraph      |
  | max_size_GB | integer        | Upper limit of subgraph capacity |

  **Output:**

  if successful , it will return true.

  **Example input:**

  ```unknow
  CALL dbms.graph.createGraph('graph1', 'description', 2045)
  ```

  **Example output:**
  
  | success |
  |---------|
  | true    |

* dbms.graph.deleteGraph(graph_name)

  delete a subgraph in this graph database .
  
  | parameter  | parameter type |             description              |
  |------------|----------------|--------------------------------------|
  | graph_name | string         | the name of subgraph to been deleted |

  **Output:**

  if successful , it will return true.

  **Example input:**

  ```sql
  CALL dbms.graph.deleteGraph('graph1')
  ```

  **Example output:**
  
  | success |
  |---------|
  | true    |

* dbms.graph.modGraph(graph_name, config)

  delete a subgraph in this graph database .

  **Parameters:**
  
  | parameter  | parameter type |             description              |
  |------------|----------------|--------------------------------------|
  | graph_name | string         | the name of subgraph to been deleted |
  | config     | map            | the configuration to be modified     |

  **Output:**

  if successful , it will return true.

  **Example input:**

  ```sql
  CALL dbms.graph.modGraph('graph1',{description:'this graph', max_size_GB:20})
  ```

  **Example output:**
  
  | success |
  |---------|
  | true    |

* dbms.graph.listGraphs()

  get all subgraph in this graph database .

  **Output:**

  a list of .

  **Example input:**

  ```sql
  CALL dbms.graph.listGraphs()
  ```

  **Example output:**
  
  | graph.name |                 configuration                 |
  |------------|-----------------------------------------------|
  | default    | {"description":"","max_size_GB":1024}         |
  | graph1     | {"description":"this graph","max_size_GB":20} |
  | ...        | ...                                           |

* dbms.config.list()

  get some config of this graph database .

  **Output:**

  a list of .

  **Example input:**

  ```sql
  CALL dbms.config.list()
  ```

  **Example output:**
  
  |   name    |  value  |
  |-----------|---------|
  | bind_host | 0.0.0.0 |
  | db_async  | true    |
  | ...       | ...     |

* dbms.config.update(updates)

  get some config of this graph database .

  **Output:**

  If successful, it returns a success message

  **Example input:**

  ```sql
  CALL dbms.config.update({
  enable_ip_check:false,
  db_async:true,
  optimistic_txn:true,
  enable_audit_log:true})
  ```

  **Example output:**

  ```sql
  Update succeeded.
  ```

* dbms.takeSnapshot()

  take the snapshot on this current graph database.

  **Output:**

  If successful, it returns the path of snapshot.

  **Example input:**

  ```sql
  CALL dbms.takeSnapshot()
  ```

  **Example output:**
  
  |                path                 |
  |-------------------------------------|
  | log/db/snapshot/2020-07-20_17.20.03 |

* dbms.listBackupFiles()

  get the path of backuped files.

  **Output:**

  If successful, it returns the path of snapshot.

  **Example input:**

  ```sql
  CALL dbms.listBackupFiles()
  ```

  **Example output:**
  
  |            path            |
  |----------------------------|
  | tugraph/db/binlog/binlog_0 |

* algo.shortestPath(startNode, endNode, config)

  get one of the shortest paths between two vertexes.

  **Parameters:**
  
  | parameter | parameter type |                                       description                                       |
  |-----------|----------------|-----------------------------------------------------------------------------------------|
  | startNode | Node           | the source node of paths                                                                |
  | endNode   | Node           | the destination node paths                                                              |
  | config    | MAP            | the filter of shortest paths, the formate as {maxHops:3, relationshipQuery:'HAS_CHILD'} |

  **Output:**

  If successful, it will returns one group result of the shortest path.

  **Example input:**

  ```sql
  MATCH (n1 {name:'Hugo Weaving'}),(n2 {title:'The Matrix'})
  CALL algo.shortestPath(n1,n2) YIELD nodeCount,totalCost RETURN nodeCount,totalCost
  ```

  **Example output:**
  
  | nodeCount | totalCost |
  |-----------|-----------|
  | 2         | 1         |

* algo.allShortestPaths(startNode, endNode, config))

  get the path of backuped files.

  **Output:**

  If successful, it returns the path of snapshot.

  **Example input:**

  ```sql
  MATCH (n1 {name:'Hugo Weaving'}),(n2 {title:'The Matrix'})
  CALL algo.allShortestPaths(n1,n2) YIELD nodeIds,cost RETURN nodeIds,cost
  ```

  **Example output:**
  
  |  nodeIds  | cost |
  |-----------|------|
  | \[2,665\] | 1    |
  | ...       |      |

* algo.algo.native.extract(id, config))

  get the field values of a list of vertexes or edges.

  **Parameters:**
  
  | parameter | parameter type |                        description                         |
  |-----------|----------------|------------------------------------------------------------|
  | id        | ANY            | the id of vertexes or edges , the id must be variable      |
  | config    | MAP            | the configuration of  this extraction of vertexes or edges |

  in which each `config` is a map in the form of `{isNode:true, filed:'HAS_CHILD'}`, if `isNode` is specified true, the `id` is a vertex id, or it is an edge id.

  **Output:**

  If successful, it returns a list of the value of vertexes or edges specified field .

  **Example input:**

  ```sql
  with [2,3] as vids CALL algo.native.extract(vids,{isNode:true, field:'id'})
  YIELD value  RETURN value
  ```

  **Example output:**
  
  |  value  |
  |---------|
  | \[4,5\] |

### 内置 Procedures 完整列表

|                 Name                 |              Description              |                                              Signature                                              |                                         |                                      |                       |             |
|--------------------------------------|---------------------------------------|-----------------------------------------------------------------------------------------------------|-----------------------------------------|--------------------------------------|-----------------------|-------------|
| db.labels                            | 列出所有Vertex Label                      | db.labels() :: (label::STRING)                                                                      |                                         |                                      |                       |             |
| db.relationshipTypes                 | 列出所有Edge Label                        | db.relationshipTypes() :: (relationshipType::STRING)                                                |                                         |                                      |                       |             |
| db.indexes                           | 列出所有索引                                | db.indexes() :: (index::LIST)                                                                       |                                         |                                      |                       |             |
| db.propertyKeys                      | 列出所有的property keys                    | db.propertyKeys() :: (propertyKey::STRING)                                                          |                                         |                                      |                       |             |
| db.warmup                            | 预热数据                                  | db.warmup() :: ()                                                                                   |                                         |                                      |                       |             |
| db.addLabel                          | 创建Vertex Label                        | db.addLabel(label_name::STRING                                                                      | field_specs::LIST) :: ()                |                                      |                       |             |
| db.addType                           | 创建Edge Label                          | db.addType(type_name::STRING                                                                        | field_specs::LIST) :: ()                |                                      |                       |             |
| db.addIndex                          | 创建索引                                  | db.addIndex(label_name::STRING                                                                      | field_name::STRING                      | is_unique::BOOLEAN) :: ()            |                       |             |
| db.backup                            | 备份数据                                  | db.backup(destination::STRING) :: ()                                                                |                                         |                                      |                       |             |
| dbms.procedures                      | 列出所有procedures                        | dbms.procedures() :: (name::STRING                                                                  | signature::STRING)                      |                                      |                       |             |
| dbms.security.changePassword         | 更改当前用户的密码                             | dbms.security.changePassword(current_password::STRING                                               | new_passwordSTRING) :: (successBOOLEAN) |                                      |                       |             |
| dbms.security.changeUserPassword     | 更改指定用户的密码                             | dbms.security.changeUserPassword(user_name::STRING                                                  | new_passwordSTRING) :: (successBOOLEAN) |                                      |                       |             |
| dbms.security.changeUserRole         | 更改指定用户的角色                             | dbms.security.changeUserRole(user_name::STRING                                                      | is_adminBOOLEAN) :: (successBOOLEAN)    |                                      |                       |             |
| dbms.security.createUser             | 创建用户                                  | dbms.security.createUser(user_name::STRING                                                          | password::STRING                        | is_adminBOOLEAN) :: (successBOOLEAN) |                       |             |
| dbms.security.deleteUser             | 删除用户                                  | dbms.security.deleteUser(user_nameSTRING) :: (successBOOLEAN)                                       |                                         |                                      |                       |             |
| dbms.security.listUsers              | 列出所有用户                                | dbms.security.listUsers() :: (user_name::STRING                                                     | is_admin::BOOLEAN)                      |                                      |                       |             |
| dbms.security.showCurrentUser        | 列出当前用户信息                              | dbms.security.showCurrentUser() :: (current_user::STRING)                                           |                                         |                                      |                       |             |
| dbms.security.accessPermission       | 查询指定用户对指定子图的访问权限                      | dbms.security.accessPermission(user_name::STRING                                                    | graph_nameSTRING) :: (graph_nameSTRING  | user_name::STRING                    | acl::STRING)          |             |
| dbms.security.setAccessPermission    | 设置指定用户对指定子图的访问权限                      | dbms.security.setAccessPermission(user_name::STRING                                                 | graph_name::STRING                      | aclSTRING) :: (successBOOLEAN)       |                       |             |
| dbms.security.deleteAccessPermission | 删除指定用户对指定子图的访问权限                      | dbms.security.deleteAccessPermission(user_name::STRING                                              | graph_nameSTRING) :: (successBOOLEAN)   |                                      |                       |             |
| dbms.graph.createGraph               | 创建子图                                  | dbms.graph.createGraph(graph_nameSTRING, descriptionSTRING, max_size_GBINTEGER) :: (successBOOLEAN) |                                         |                                      |                       |             |
| dbms.graph.modGraph                  | 修改子图属性                                | dbms.graph.modGraph(graph_nameSTRING, configMAP) :: (success::BOOLEAN)                              |                                         |                                      |                       |             |
| dbms.graph.deleteGraph               | 删除子图                                  | dbms.graph.deleteGraph(graph_nameSTRING) :: (successBOOLEAN)                                        |                                         |                                      |                       |             |
| dbms.graph.listGraphs                | 列出所有子图                                | dbms.graph.listGraphs() :: (graph_name::STRING                                                      | configuration::STRING)                  |                                      |                       |             |
| algo.shortestPath                    | 查询两个顶点间的最短路径                          | algo.shortestPath(startNode::NODE                                                                   | endNode::NODE                           | configMAP) :: (nodeCountINTEGER      | totalCost::FLOAT)     |             |
| algo.allShortestPaths                | 查询两个顶点间的所有最短路径                        | algo.allShortestPaths(startNode::NODE                                                               | endNode::NODE                           | configMAP) :: (nodeIdsLIST           | relationshipIds::LIST | cost::LIST) |
| algo.native.extract                  | 查询指定VertexId/EdgeUid（列表）指定field的值（列表） | algo.native.extract(id::ANY                                                                         | configMAP) :: (valueANY)                |                                      |                       |             |
